---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewDepth
source: html/94135d3b-cdf4-b40e-0eae-afa2a4e6eb42.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewDepth Property

"View Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewDepth { get; }
```